{
  "backend/main.mo": "Empty Motoko actor with no methods.",
  "feature_evidence.json": "Feature evidence report describing logo rendering, fallback branding, and layout requirements with associated files and metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries of key frontend files including layout, pages, config, hooks, and components.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH-driven light/dark theme tokens and global styles.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router with routes for main pages inside SiteLayout.",
  "frontend/src/components/brand/BrandMark.tsx": "Logo component that displays an image with automatic fallback text if loading fails.",
  "frontend/src/components/layout/SiteFooter.tsx": "Footer with branding, navigation links, contact details, and attribution.",
  "frontend/src/components/layout/SiteHeader.tsx": "Responsive header with logo, desktop navigation, and mobile drawer menu.",
  "frontend/src/components/layout/SiteLayout.tsx": "Page wrapper rendering header, routed content, and footer.",
  "frontend/src/constants/contact.ts": "Centralized contact info object shared across the site.",
  "frontend/src/hooks/useActor.ts": "Creates and manages backend actor instances based on Internet Identity state with React Query.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and logic using AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Placeholder for future backend-related React Query hooks.",
  "frontend/src/index.css": "Defines Tailwind layers and CSS variables for light/dark themes with fintech color palette and global styles.",
  "frontend/src/main.tsx": "Bootstraps the React app, setting up React Query and Internet Identity provider before rendering App.",
  "frontend/src/pages/ContactPage.tsx": "Implements a contact form with validation, mailto submission, clipboard fallback, and info cards.",
  "frontend/src/pages/HomePage.tsx": "Creates the homepage with hero banner, feature highlights, and services overview sections.",
  "frontend/src/pages/ProductPage.tsx": "Displays product details, benefits, and hero section for an AI-driven reconciliation platform.",
  "frontend/src/pages/ServicesPage.tsx": "Shows consulting service offerings with a grid of service cards and descriptive sections.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, animations, theme extensions, and plugins.",
  "project_state.json": "Describes the project's current website state, including branding corrections, deployment issues, and required fixes. Lists existing implemented features and known issues related to assets, naming, and missing codebase."
}