{
  "kind": "build_request",
  "title": "Fix website logo not rendering and allow flexible logo placement",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-19",
      "text": "Fix the site branding logo so a logo reliably renders in both the header and footer on all pages. Ensure the logo asset path is valid in production builds (including case sensitivity), the file is present in the correct static assets directory, and the rendered logo is visible (not zero-sized/hidden) on both desktop and mobile navigation.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "you can keep logo as you feel good. My uploaded logo is not showing on the website. You can keep logo as you want to place"
        ]
      },
      "acceptanceCriteria": [
        "On Home/Services/Product/Contact pages, a logo is visible in the top navigation bar.",
        "In the mobile menu (sheet) header, a logo is visible.",
        "In the footer, a logo is visible.",
        "The deployed build loads the logo without 404s; the referenced path matches the actual filename and casing.",
        "Logo has sensible sizing (non-zero height) and does not break layout at common breakpoints."
      ]
    },
    {
      "id": "REQ-20",
      "text": "Add a graceful fallback if the logo image cannot be loaded: display a text-based brand mark (\"ABM Nexttech LLP\") in the same location so the header and footer never appear without branding.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "My uploaded logo is not showing on the website."
        ]
      },
      "acceptanceCriteria": [
        "If the logo image fails to load, the header shows the text \"ABM Nexttech LLP\" instead of a broken image.",
        "If the logo image fails to load, the footer shows the text \"ABM Nexttech LLP\" instead of a broken image.",
        "Fallback text is accessible and does not introduce new spelling variants of the company name."
      ]
    },
    {
      "id": "REQ-21",
      "text": "Allow flexible logo placement consistent with the existing design: it is acceptable to adjust the logo placement/spacing in the header and footer as needed, as long as it remains professional and the logo renders correctly.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "You can keep logo as you want to place"
        ]
      },
      "acceptanceCriteria": [
        "Logo placement updates (if any) keep navigation links usable and aligned on desktop.",
        "Logo placement updates (if any) keep the mobile menu toggle usable and aligned on small screens.",
        "Footer layout remains readable and balanced after any logo placement changes."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (read-only).",
    "Do not edit immutable paths listed in SYSTEM_CONTEXT (e.g., frontend/src/main.tsx, frontend/src/hooks/useActor.ts, frontend/src/hooks/useInternetIdentity.ts).",
    "Keep all user-facing text in English."
  ],
  "nonGoals": [
    "Adding new pages or new marketing content beyond what is needed to fix logo rendering.",
    "Implementing backend logo storage or uploading; logo should be served as a static frontend asset."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}