{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix logo rendering and add resilient brand mark in header/footer",
  "requirements": [
    {
      "id": "REQ-19",
      "summary": "Ensure the site logo reliably renders in header (desktop + mobile sheet) and footer using a production-safe static asset path and visible sizing.",
      "acceptanceCriteria": [
        "On Home/Services/Product/Contact pages, a logo is visible in the top navigation bar.",
        "In the mobile menu (sheet) header, a logo is visible.",
        "In the footer, a logo is visible.",
        "The deployed build loads the logo without 404s; the referenced path matches the actual filename and casing.",
        "Logo has sensible sizing (non-zero height) and does not break layout at common breakpoints."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/abm-nexttech-wordmark-transparent.dim_1200x300.png",
          "operation": "create",
          "description": "Add/ensure the logo file exists in the production static assets directory at this exact path and filename casing so it can be referenced reliably by the UI."
        },
        {
          "path": "frontend/src/components/layout/SiteHeader.tsx",
          "operation": "modify",
          "description": "Replace the current hardcoded logo src with a production-safe asset reference (matching actual filename/casing) and ensure the rendered logo has non-zero, responsive sizing in both the desktop header and mobile sheet header."
        },
        {
          "path": "frontend/src/components/layout/SiteFooter.tsx",
          "operation": "modify",
          "description": "Replace the current hardcoded logo src with a production-safe asset reference (matching actual filename/casing) and ensure the footer logo renders visibly with sensible sizing across breakpoints."
        }
      ]
    },
    {
      "id": "REQ-20",
      "summary": "Add a graceful, accessible text fallback brand mark (\"ABM Nexttech LLP\") if the logo image fails to load in header and footer.",
      "acceptanceCriteria": [
        "If the logo image fails to load, the header shows the text \"ABM Nexttech LLP\" instead of a broken image.",
        "If the logo image fails to load, the footer shows the text \"ABM Nexttech LLP\" instead of a broken image.",
        "Fallback text is accessible and does not introduce new spelling variants of the company name."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/brand/BrandMark.tsx",
          "operation": "create",
          "description": "Create a reusable BrandMark component that renders the logo image and, on load failure, switches to an accessible text fallback that exactly reads \"ABM Nexttech LLP\" (no spelling variants)."
        },
        {
          "path": "frontend/src/components/layout/SiteHeader.tsx",
          "operation": "modify",
          "description": "Use the new BrandMark component for the header logo and the mobile sheet header logo so both locations always show branding (image or text fallback)."
        },
        {
          "path": "frontend/src/components/layout/SiteFooter.tsx",
          "operation": "modify",
          "description": "Use the new BrandMark component for the footer branding so it always shows branding (image or text fallback)."
        }
      ]
    },
    {
      "id": "REQ-21",
      "summary": "Adjust logo placement/spacing in header and footer as needed to keep a professional layout and maintain usability across breakpoints.",
      "acceptanceCriteria": [
        "Logo placement updates (if any) keep navigation links usable and aligned on desktop.",
        "Logo placement updates (if any) keep the mobile menu toggle usable and aligned on small screens.",
        "Footer layout remains readable and balanced after any logo placement changes."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/layout/SiteHeader.tsx",
          "operation": "modify",
          "description": "Refine header layout classes around the BrandMark (alignment, spacing, and responsive sizing) so desktop navigation and the mobile menu toggle remain usable and visually aligned."
        },
        {
          "path": "frontend/src/components/layout/SiteFooter.tsx",
          "operation": "modify",
          "description": "Refine footer branding layout/spacing around the BrandMark to keep the footer readable and balanced after logo placement updates."
        }
      ]
    }
  ]
}